# ~/Brewfile

# This file is used along with the `brew bundle` command to ensure that required packages and apps are installed
# Also can be used to ensure that any package/apps that were installed as experimentation are uninstalled from the system

# List all casks that are outdated (and which have version marked as 'latest')
# alias bcg='brew cask outdated --greedy'

# Upgrades all casks that are outdated (and which have version marked as 'latest')
# alias bcug='brew cask upgrade --greedy'

# Upgrades and cleans up all regular outdated casks and libs (non-greedy
# alias bupc='brew upgrade; brew cask upgrade; brew bundle check --file=~/Brewfile || brew bundle --file=~/Brewfile; brew bundle cleanup --force --file=~/Brewfile; brew cleanup prune'

cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
# tap 'horar/openconnect-gui'
tap 'moul/moul'
tap 'theseal/ssh-askpass'

brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'coreutils'  # pre-requisite for asdf
brew 'diff-so-fancy'
brew 'direnv'
brew 'docker-diff'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-crypt'
brew 'gnupg'
brew 'gradle'
brew 'htop'
brew 'kubernetes-cli'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'make'
brew 'openssl', link: true
brew 'prettyping'
brew 'readline'
brew 'tldr'
brew 'vim'
brew 'wget'
brew 'zlib', link: true
brew 'zsh'


cask 'adobe-reader'
cask 'appcleaner'
cask 'audacity'
cask 'docker'
cask 'dropbox'
cask 'dupeguru'
 cask 'evernote'
# cask 'firefox'
cask 'firefox-beta'
cask 'freemind'
cask 'google-chrome-beta'
cask 'google-drive-file-stream'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'kdiff3'
# cask 'keepassxc'
#cask 'keepassxc-beta'
cask 'keepingyouawake'
cask 'libreoffice'  # not using currently - since I have installed MS Office
cask 'monolingual'
cask 'onyx'
cask 'spectacle'
cask 'thunderbird-beta'
cask 'vlc'

cask 'visual-studio-code'
cask 'sophos-anti-virus-home-edition'
